<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//FR">

<html>
<head>
	<title>Aide ALC Touch</title>
</head>

<body>

<p>
<h1><font face="" color="Red">Sommaire</font></h1>
<ul><h2><li><a href="#1">Pr&eacute;sentation du programme</h2>
<h2><li><a href="#2">Prise en main du programme</a></h2>
<ol><h3><li><a href="#2_1">S&eacute;lection des fichiers &agrave; modifiers</a>
<li><a href="#2_2">Op&eacute;rations &agrave; effectuer sur les fichiers</a>
<li><a href="#2_3">Ex&eacute;cuter les modifications</a>
<li><a href="#2_4">Comment &ccedil;a marche les zones ou l'on <b>sp&eacute;cifit</b> le nom d'un fichier ?</a></h3></ol>
</ul>
<hr align="CENTER" size="5">

<p>
<a name="1"><h2><font face="" color="Red">Pr&eacute;sentation du programme</font></h2>
Ce programme est destin&eacute; &agrave; remplacer les fonctions DOS existantes dont l'utilisation n'est pas ais&eacute;e. En plus de cela les fonctions sont am&eacute;lior&eacute;es et adapt&eacute;es &agrave; Windows 95/98.<br>
<br><br></a>

<p>
<a name="2"><h2><font face="" color="Red">Prise en main du programme</font></h2>
Le programme se pr&eacute;sente comme un Wizard o&ugrave; l'on progresse en 3 &eacute;tapes.<br>
<ol><a name="2_1"><h3><font face="" color="Blue"><li>S&eacute;lection des fichiers &agrave; modifiers</font></h3>
<dd>Dans cette partie vous <b>d&eacute;finissez les fichiers</b> &agrave; modifiers.<br>
<dd>Commencez par indiquer le <b>r&eacute;pertoire</b> o&ugrave; se trouve les fichiers.<br>
<dd>L'options &quot;<b>Inclure les sous-r&eacute;pertoires</b>&quot; permet de modifers les fichiers du r&eacute;pertoire s&eacute;lectionn&eacute; et de modifiers les fichiers se trouvant dans les r&eacute;pertoires de celui s&eacute;lectionn&eacute;.<br>
<dd>Les <b>attributs</b> fonctionnent de la fa&ccedil;on suivante: Prenons l'exemple de l'attribut &quot;Lecture seule&quot;, si il est gris&eacute; le programme prend les fichiers ayant cet attribut ou nom. Si il est coch&eacute;, seul les fichiers poss&eacute;dant cet attribut sont pris. S'il ne l'est pas, seul les fichiers n'ayant pas cet attribut sont pris. Maintenant si vous voulez les fichier ayant l'attibut Archive mais pas l'attribut Syst&egrave;me, les autres vous &eacute;tants indiff&eacute;rents: Cochez Archive, d&eacute;cochez Syst&egrave;me et laissez les autres en gris.<br>
<dd>La zone &quot;<b>Sp&eacute;cification</b>&quot; vous permet de filtrer les type de fichiers, leur extention et leur nom. Pour plus d'informations <a href="#2_4">cliquez ici</a>..<br>
<dd>Il se peut que vous souhaitiez encore r&eacute;duire la s&eacute;tion. Cochez alors &quot;<b>Fichiers s&eacute;lectionn&eacute;s</b>&quot;, puis cliquez sur &quot;<b>Rafraichir</b>&quot; ou &quot;<b>Afficher</b>&quot; (selon celui qui appara&icirc;t. Vous aurez une liste des TOUS les fichiers correspondant &agrave; vos crit&egrave;res pr&eacute;c&eacute;dents. A c&ocirc;t&eacute; de chaque fichier &agrave; modifier cocher la case.<br>
<dd>Vous pouvez aussi utiliser &quot;<b>Rafraichir</b>&quot; ou &quot;<b>Afficher</b>&quot; (selon celui qui appara&icirc;t) pour voir la liste des fichiers correspondant &agrave; vos crit&egrave;res.</a><br><br>
<a name="2_2"><h3><font face="" color="Blue"><li>Op&eacute;rations &agrave; effectuer sur les fichiers</font></h3>
Vous d&eacute;vinissez ici les <b>op&eacute;rations</b> &agrave; effectu&eacute;s sur les <b>fichiers s&eacute;lectionn&eacute;s</b> dans la partie d'avant. Vous pouvez effectuer simultan&eacute;ment plusieurs modification en cochant la case &agrave; gauche du nom de la modification &agrave; faire. Il existe 4 type de modification:
<ol><li><b>Date & Heure :</b>
Chaque fichier Windows poss&egrave;de 3 dates. La date de <b>cr&eacute;ation</b> du fichier, la date de la derni&egrave;re <b>modification</b> et du dernier <b>acc&egrave;s</b> (lecture) du fichier. Cochez la case &agrave; gauche des date &agrave; changer et entrez la nouvelle date ou demander &agrave; placer la date courante.
<li><b>Case :</b>
Depuis Windows 32bits les fichiers peuvent &ecirc;tre en <b>majuscule</b> ou <b>minuscule</b>: C'est la case. Cependant <b>L'explorateur Windows</b> n'affiche pas forc&eacute;ment les fichers qui sont qu'en majuscule en majuscule.
<li><b>Renommer :</b>
Commencez par donner les sp&eacute;cifications du nom de d&eacute;part dans la zone de texte du haut dans la zone &quot;Renommer&quot;. Cette premi&egrave;re &eacute;tape permet de filtrer encore une fois les fichiers, mais surtout vous devez placer un <b>chiffre</b> (0123456789) apr&egrave;s <b>chaque</b> &quot;*&quot; ou &quot;?&quot;. Si vous mettez &quot;*1&quot; dans la premi&egrave;re zone, la o&ugrave; vous placerez &quot;*1&quot; dans la seconde zone (si vous le mettez), il sera remplac&eacute; par ce qui se trouvait &agrave; la place de &quot;*1&quot; dans la premi&egrave;re zone.<br>
Exmple: Vous voulez changer toute une suite de documents ayant l'extention "doc", commen&ccedil;ant par "Compte", finissant par "2000" ou "2001" ou plus. Mais vous ne voulez pas changer les fichier "Compte2000.doc". Dans ces fichiers vous voulez changer le "2000" ou "2001"... en "00" ou "01" ...<br>
Extrez dans la premi&egrave;re zone &quot;<b>Compte*1?1?2?3?4?5?6.doc</b>&quot; et dans la seconde &quot;<b>Compte*1?1?3?4.doc</b>&quot;.<br>
Les changement seront alors:<br>
<table>
<tr>
	<td>Compte2000.doc</td>
	<td>-></td>
	<td>Compte2000.doc</td>
</tr>
<tr>
	<td>Compte25-01-2000.doc</td>
	<td>-></td>
	<td>Compte25-01-00.doc</td>
</tr>
<tr>
	<td>Compte25-01-2001.doc</td>
	<td>-></td>
	<td>Compte25-01-01.doc</td>
</tr>
<tr>
	<td>etc.</td>
	<td>-></td>
	<td>etc.</td>
</tr>
</table>

<li><b>Attributs :</b>
Changez ici les attributs des fichiers. Elle fonctionne presque comme celle de la 1ere partie &agrave; la diff&eacute;rence qu'ici il ne s'agit plus de filtrer mais de <b>changer</b> mes attributs.<br>
Les attributs en gris ne seront pas chang&eacute;s. Si vous cochez un attribut, il sera <b>mis</b>, si vous d&eacute;cochez un attribut il sera <b>enlev&eacute;</b>.</ol></a><br>
<a name="2_3"><h3><font face="" color="Blue"><li>Ex&eacute;cuter les modifications</font></h3>
Vous pouvez &agrave; tout moment aller voir cette partie pour voir ce que vous n'avez oubli&eacute; de d&eacute;finir. Si des modifications peuvent &ecirc;tre effectu&eacute;es, vous n'avez qu'&agrave; cliquer sur le gros <b>bouton central</b> pour <b>lancer les modifications</b>. C'est <b>seulement</b> &agrave; ce moment que les fichiers sont chang&eacute;s.<br>
Si vous voulez aller plus vite, cliquez sur &quot;<b>Ex&eacute;cuter</b>&quot; en bas &agrave; gauche.</a>
</ol>
<a name="2_4"><h3><font face="" color="Blue">Comment &ccedil;a marche les zones ou l'on <b>sp&eacute;cifit</b> le nom d'un fichier ?</font></h3>
Les sp&eacute;cifications dans &quot;<b>Renommer</b>&quot; permettent l'utilisation de <b>plusieurs</b> &quot;*&quot; et/ou &quot;?&quot; dans chaque sp&eacute;cification. En plus de cela vous devez y placer un chiffre apr&egrave;s chaque &quot;*&quot; ou &quot;?&quot;.<br>
Dans <b>toutes</b> les zones de sp&eacute;cification les &quot;*&quot; repr&eacute;sentent n'importe quel caract&egrave;re ou suite de caract&egrave;res, voir m&ecirc;me aucun caract&egrave;re. Les &quot;?&quot; repr&eacute;sentent un caract&egrave;re n'importe lequel.<br>
(Les exemples ci-dessous marchent partout sauf dans pour &quot;<b>Renommer</b>&quot; o&ugrave; il faut un chiffre avec les * et ?)<br>
Vous devez mettre un &quot;.&quot; pour s&eacute;parer le nom de l'extention (sauf <b>Renommer</b>). Finissez par &quot;.*&quot; si l'extention vous est &eacute;gale ou inconnue. Si vous voulez conna&icirc;tre l'extention d'un fichier, cliquez droit sur ce fichier dans l'<b>Explorateur Windows</b> par exemple puis &quot;Propri&eacute;t&eacute;s&quot;, vous la verrez en haut dans la fen&ecirc;tre qui s'affiche normalement.
&quot;*.*&quot; repr&eacute;sente tous les fichiers, n'importe leur nom et leur extention. Si vous voulez que les images Bitmap commen&ccedil;ant par &quot;Img&quot;, entrez dans cette zone: &quot;Img*.bmp&quot;<br>
</a></a>
<br>
<br>
<hr>
<div align="center">Copyright (c) ALC Informatique 2000</div>
<hr>

</body>
</html>
